<?xml version="1.0" ?>
<net name="best_5e_sim" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1, 3, 320, 320" element_type="f16"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="images/scale_copy" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_625">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="/model.0/conv/conv.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/model.0/conv/conv.0/Conv/Dims4505" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1728" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/model.0/conv/conv.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.0/conv/conv.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/model.0/conv/conv.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.0/conv/conv.2/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/model.0/maxpool/MaxPool" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.0/maxpool/MaxPool_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="model.1.branch1.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1792" size="576"/>
			<output>
				<port id="0" precision="FP16" names="model.1.branch1.0.weight">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/model.1/branch1/branch1.0/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/model.1/branch1/branch1.0/Conv/Dims4589" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2368" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/model.1/branch1/branch1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/branch1/branch1.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="model.1.branch1.1.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 32, 1, 1" offset="2432" size="3840"/>
			<output>
				<port id="0" precision="FP16" names="model.1.branch1.1.weight">
					<dim>60</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/model.1/branch1/branch1.1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/model.1/branch1/branch1.1/Conv/Dims4433" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="6272" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/model.1/branch1/branch1.1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/branch1/branch1.1/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/model.1/branch1/branch1.2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.1/branch1/branch1.2/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="model.1.branch2.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 32, 1, 1" offset="6392" size="3840"/>
			<output>
				<port id="0" precision="FP16" names="model.1.branch2.0.weight">
					<dim>60</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/model.1/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/model.1/branch2/branch2.0/Conv/Dims4601" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="10232" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/model.1/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/branch2/branch2.0/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/model.1/branch2/branch2.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.1/branch2/branch2.1/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="model.1.branch2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 1, 1, 3, 3" offset="10352" size="1080"/>
			<output>
				<port id="0" precision="FP16" names="model.1.branch2.2.weight">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/model.1/branch2/branch2.2/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/model.1/branch2/branch2.2/Conv/Dims4361" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="11432" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/model.1/branch2/branch2.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/branch2/branch2.2/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="model.1.branch2.3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="11552" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.1.branch2.3.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/model.1/branch2/branch2.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/model.1/branch2/branch2.3/Conv/Dims4691" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="18752" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/model.1/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/branch2/branch2.3/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/model.1/branch2/branch2.4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.1/branch2/branch2.4/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/model.1/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/Concat_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/model.1/Constant_output_018550" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18872" size="40"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/model.1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="368" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18912" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/model.1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/Transpose_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/model.1/Constant_1_output_018139" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="18952" size="32"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/model.1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.1/Reshape_1_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="633118325" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18984" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="38" name="633318667" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18992" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/model.2/model.2.0/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="/model.2/model.2.0/Slice_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP16" names="/model.2/model.2.0/Slice_1_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="model.2.0.branch2.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="19008" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.0.branch2.0.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/model.2/model.2.0/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="/model.2/model.2.0/branch2/branch2.0/Conv/Dims4391" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="26208" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/model.2/model.2.0/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/branch2/branch2.0/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/model.2/model.2.0/branch2/branch2.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.0/branch2/branch2.1/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="model.2.0.branch2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 1, 1, 3, 3" offset="26328" size="1080"/>
			<output>
				<port id="0" precision="FP16" names="model.2.0.branch2.2.weight">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/model.2/model.2.0/branch2/branch2.2/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/model.2/model.2.0/branch2/branch2.2/Conv/Dims4673" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="27408" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/model.2/model.2.0/branch2/branch2.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/branch2/branch2.2/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="model.2.0.branch2.3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="27528" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.0.branch2.3.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/model.2/model.2.0/branch2/branch2.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/model.2/model.2.0/branch2/branch2.3/Conv/Dims4517" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="34728" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/model.2/model.2.0/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/branch2/branch2.3/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/model.2/model.2.0/branch2/branch2.4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.0/branch2/branch2.4/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/model.2/model.2.0/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/Concat_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/model.1/Constant_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18872" size="40"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/model.2/model.2.0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="374" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18912" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/model.2/model.2.0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/Transpose_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/model.1/Constant_1_output_018322" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="18952" size="32"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/model.2/model.2.0/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.0/Reshape_1_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="633618313" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18984" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="62" name="633818637" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18992" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/model.2/model.2.1/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="/model.2/model.2.1/Slice_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP16" names="/model.2/model.2.1/Slice_1_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="model.2.1.branch2.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="34848" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.1.branch2.0.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/model.2/model.2.1/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/model.2/model.2.1/branch2/branch2.0/Conv/Dims4499" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="42048" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/model.2/model.2.1/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/branch2/branch2.0/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/model.2/model.2.1/branch2/branch2.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.1/branch2/branch2.1/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="model.2.1.branch2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 1, 1, 3, 3" offset="42168" size="1080"/>
			<output>
				<port id="0" precision="FP16" names="model.2.1.branch2.2.weight">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/model.2/model.2.1/branch2/branch2.2/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/model.2/model.2.1/branch2/branch2.2/Conv/Dims4667" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="43248" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/model.2/model.2.1/branch2/branch2.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/branch2/branch2.2/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="model.2.1.branch2.3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="43368" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.1.branch2.3.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/model.2/model.2.1/branch2/branch2.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/model.2/model.2.1/branch2/branch2.3/Conv/Dims4613" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="50568" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/model.2/model.2.1/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/branch2/branch2.3/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/model.2/model.2.1/branch2/branch2.4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.1/branch2/branch2.4/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/model.2/model.2.1/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/Concat_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/model.1/Constant_output_018418" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18872" size="40"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/model.2/model.2.1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="372" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18912" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/model.2/model.2.1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/Transpose_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/model.1/Constant_1_output_0" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="18952" size="32"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/model.2/model.2.1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.1/Reshape_1_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="634118106" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="18984" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="634318691" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18992" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/model.2/model.2.2/Slice/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16" names="/model.2/model.2.2/Slice_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP16" names="/model.2/model.2.2/Slice_1_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="model.2.2.branch2.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="50688" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.2.branch2.0.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/model.2/model.2.2/branch2/branch2.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/model.2/model.2.2/branch2/branch2.0/Conv/Dims4637" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="57888" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/model.2/model.2.2/branch2/branch2.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/branch2/branch2.0/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/model.2/model.2.2/branch2/branch2.1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.2/branch2/branch2.1/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="model.2.2.branch2.2.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 1, 1, 3, 3" offset="58008" size="1080"/>
			<output>
				<port id="0" precision="FP16" names="model.2.2.branch2.2.weight">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/model.2/model.2.2/branch2/branch2.2/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/model.2/model.2.2/branch2/branch2.2/Conv/Dims4679" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="59088" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/model.2/model.2.2/branch2/branch2.2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/branch2/branch2.2/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="model.2.2.branch2.3.weight" type="Const" version="opset1">
			<data element_type="f16" shape="60, 60, 1, 1" offset="59208" size="7200"/>
			<output>
				<port id="0" precision="FP16" names="model.2.2.branch2.3.weight">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/model.2/model.2.2/branch2/branch2.3/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>60</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/model.2/model.2.2/branch2/branch2.3/Conv/Dims4697" type="Const" version="opset1">
			<data element_type="f16" shape="1, 60, 1, 1" offset="66408" size="120"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/model.2/model.2.2/branch2/branch2.3/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/branch2/branch2.3/Conv_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/model.2/model.2.2/branch2/branch2.4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="/model.2/model.2.2/branch2/branch2.4/Relu_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/model.2/model.2.2/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/Concat_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/model.1/Constant_output_018352" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18872" size="40"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_output_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/model.2/model.2.2/Reshape" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/Reshape_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="382" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="18912" size="40"/>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/model.2/model.2.2/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>60</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/Transpose_output_0">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/model.1/Constant_1_output_018586" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="18952" size="32"/>
			<output>
				<port id="0" precision="I64" names="/model.1/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/model.2/model.2.2/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>60</dim>
					<dim>2</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="/model.2/model.2.2/Reshape_1_output_0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="model.3.branch1.0.weight" type="Const" version="opset1">
			<data element_type="f16" shape="120, 1, 1, 3, 3" offset="66528" size="2160"/>
			<output>
				<port id="0" precision="FP16" names="model.3.branch1.0.weight">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
